---
kind: method
id: M:Autodesk.Revit.DB.ImagePlacementOptions.Dispose
source: html/043daba7-8728-f28b-449f-64041103d7d8.htm
---
# Autodesk.Revit.DB.ImagePlacementOptions.Dispose Method

Releases all resources used by the ImagePlacementOptions

## Syntax (C#)
```csharp
public void Dispose()
```